app/controllers/categories_controller.rb

  def all
    render json: Category.all
---
SELECT "categories".* FROM "categories"

  def songs
    ret = Jbuilder.encode do |json|
      _songs = Song.where(category_id: params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."category_id" = 1 LIMIT 1