app/controllers/messages_controller.rb

  def show
    render json: Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", "1"]]

  def new
    # Get message details from post parameters
    src = User.find(params[:src_id])
    dst = params[:dst_email]
    content = params[:content]
    song = params[:song_id]

    # Retrieve contact. If they don't exist, create an account for them
    begin
      contact = User.find_by! email: dst
    rescue
      generated_password = Devise.friendly_token.first(8)
      contact = User.create!(email: dst, password: generated_password)
    end

    # Create a copy for the sender
    sent = Message.create(content: content, user: src, contact_id: contact.id, song_id: song, sent: true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 0]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'konakid@gmail.com' LIMIT 1
INSERT INTO "users" ("authentication_token", "created_at", "email", "encrypted_password", "referrer", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "messages" ("contact_id", "content", "created_at", "sent", "song_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["contact_id", 2], ["content", "asdf"], ["created_at", Tue, 10 Sep 2013 18:43:56 UTC +00:00], ["sent", true], ["song_id", 1], ["updated_at", Tue, 10 Sep 2013 18:43:56 UTC +00:00], ["user_id", 1]]