app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'asd' LIMIT 1
UPDATE "users" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = 9  [["last_sign_in_at", Wed, 11 Sep 2013 00:06:05 UTC +00:00], ["current_sign_in_at", Wed, 11 Sep 2013 00:29:34 UTC +00:00], ["sign_in_count", 3], ["updated_at", Wed, 11 Sep 2013 00:29:34 UTC +00:00]]
---
  def create
    resource = User.find_for_database_authentication(:email => params[:email])
    return invalid_login_attempt unless resource

    if resource.valid_password?(params[:password])
      sign_in(:user, resource)
      resource.ensure_authentication_token!

      if params[:gcm_id]
        # if the user has passed in a gcm_id
        # set the current user's gcm_id to be
        # this gcm id
        resource.gcm_id = params[:gcm_id]
        resource.save

SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1
UPDATE "users" SET "authentication_token" = $1, "updated_at" = $2 WHERE "users"."id" = 9  [["authentication_token", "u8QtdXHxG79n3crXmLmz"], ["updated_at", Wed, 11 Sep 2013 00:29:39 UTC +00:00]]
---
  def destroy
    # Look up the user based on the provided email
    resource = User.find_for_database_authentication(email: params[:email])

    # If the user resource is valid, erase the auth token and the
    # gcm id
    if resource
      resource.authentication_token = nil
      resource.gcm_id = nil
      resource.save