app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def all
    render json: Song.all.to_json(only: [:id, :title, :artist], methods: :path, include: {category: {only: [:id, :name]}})

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    song = Song.find(params[:id])