app/controllers/stats_controller.rb

SELECT "users".* FROM "users" WHERE (users.referrer IS NOT NULL)
SELECT "messages".* FROM "messages" WHERE (messages.song_id IS NOT NULL)
SELECT "users".* FROM "users" WHERE "users"."referrer" = 't'
SELECT COUNT(*) FROM "messages" WHERE (messages.song_id IS NOT NULL)
---
  def all
    @users = User.all
    @messages = Message.all
    @invitedUsers = User.where("users.referrer IS NOT NULL")
    @percentMessagesWithSongs = (Message.where("messages.song_id IS NOT NULL").size * 100) / @messages.size

SELECT "users".* FROM "users"
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 1 ORDER BY created_at DESC LIMIT 1
SELECT "messages".* FROM "messages" WHERE (user_id = 1) ORDER BY "messages"."id" DESC LIMIT 1
---
  def users
    users = User.all
    @user_data = []

    users.each do |user|
      begin
        last_activity = Message.where(user_id: user.id).order('created_at DESC')[0].created_at.to_s
      rescue
        last_activity = "never"
      end

      msgSent = Message.where(user: user, sent: true)