app/controllers/users_controller.rb

  def all
    render json: User.all.to_json(except: [:created_at, :updated_at])
---
SELECT "users".* FROM "users"

  def show
    render json: User.find(params[:id]).to_json(except: [:created_at, :updated_at])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]

  def new
    user = User.new(email: params[:email], password: params[:password], first_name: params[:first_name], last_name: params[:last_name], age: params[:age], gender: params[:gender])

    # Return the user details if successful and the error messages if unsuccessful
    if user.save
---
INSERT INTO "users" ("age", "authentication_token", "created_at", "email", "encrypted_password", "first_name", "gender", "last_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    begin
      user = User.find(params[:id])

      if age = params[:age]
        user.update!(age: age)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = 3  [["first_name", "Simon"], ["updated_at", Fri, 13 Sep 2013 20:51:41 UTC +00:00]]

  def messages
    # If a contact id was specified, show only messages with that user
    if (contact_id = params[:contact_id]) then
      render json: Message.where(user_id: params[:id], contact_id: contact_id)
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 1 AND "messages"."contact_id" IS NULL

  def generate_new_password
    # Send an email with instructs on how to reset the password
    begin
      user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]

  def contacts
    list = []
    User.find(params[:id]).messages.each do |message|
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]