app/views/stats/users.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 1 ORDER BY created_at DESC LIMIT 1
---
<script>
    $().ready(function(){
        $('#users').dataTable( {
            "aaData":
                <%= @user_data.to_s.html_safe%>

            ,
            "aoColumns": [
                { "sTitle": "ID" },
                { "sTitle": "Email" },
                { "sTitle": "Join Date" },
                { "sTitle": "First Name" },
                { "sTitle": "Last Name"},
                { "sTitle": "Age"},
                { "sTitle": "Gender"},
                { "sTitle": "# Of Contacts"},
                { "sTitle": "Messages Sent"},
                { "sTitle": "Last Activity"}
            ]
        } );

        $("#users th").each(function(){